projects/openfoam/rarefied-flows/impingment/sims/test/nozzle1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       3695;
    }
    outlet
    {
        type            patch;
        nFaces          165;
        startFace       3700;
    }
    obstacle
    {
        type            patch;
        nFaces          40;
        startFace       3865;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3800;
        startFace       3905;
    }
)

// ************************************************************************* //
